##### 데이터 전처리

1. 결측치 처리
- 제거
- 채우기

In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'score1' : [100, 90, np.nan, 95], 'score2' : [30, np.nan, 45, 56]
    ,'score3' : [52, 40, 80, 98], 'score4' : [np.nan, np.nan, np.nan, 65]}

In [3]:
df = pd.DataFrame(d)
df.head()

   score1  score2  score3  score4
0   100.0    30.0      52     NaN
1    90.0     NaN      40     NaN
2     NaN    45.0      80     NaN
3    95.0    56.0      98    65.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   score1  3 non-null      float64
 1   score2  3 non-null      float64
 2   score3  4 non-null      int64
 3   score4  1 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [6]:
#null값이 몇 개있는지 확인하기
df.isnull().sum()

score1    1
score2    1
score3    0
score4    3
dtype: int64

In [7]:
#score1의 값이 null인 행 출력
df[df.score1.isnull()]

   score1  score2  score3  score4
2     NaN    45.0      80     NaN

- 행을 기준으로 삭제

In [9]:
#null값이 있는 행 삭제후 남은 행 출력
df.dropna()

   score1  score2  score3  score4
3    95.0    56.0      98    65.0

In [10]:
#how='any': 결측치가 있는 행 전부를 지우겠다
df.dropna(axis=0, how='any')

   score1  score2  score3  score4
3    95.0    56.0      98    65.0

- 열을 기준으로 삭제

In [11]:
#null 값이 있는 열 삭제후 남은 열 출력
df.dropna(axis=1)

   score3
0      52
1      40
2      80
3      98

- 행의 전체값이 결측치인 행을 삭제

In [12]:
d2 ={'score1' : [100, np.nan, np.nan, 95], 'score2' : [np.nan, np.nan, np.nan, np.nan]
    , 'score3' : [52, np.nan, 80, 98], 'score4' : [np.nan, np.nan, np.nan, 65]}

In [18]:
df2=pd.DataFrame(d2)
df2

   score1  score2  score3  score4
0   100.0     NaN    52.0     NaN
1     NaN     NaN     NaN     NaN
2     NaN     NaN    80.0     NaN
3    95.0     NaN    98.0    65.0

In [22]:
#전체가 null 값인 행 지워주기
df2.dropna(how='all')

   score1  score2  score3  score4
0   100.0     NaN    52.0     NaN
2     NaN     NaN    80.0     NaN
3    95.0     NaN    98.0    65.0

- 임계치 설정해서 제거
    - 적당한 임계치는 분석가가 판단해서 잘 설정해야함

In [23]:
#null 값이 2개 이상인 행만 지워주기
df2.dropna(thresh=2)

   score1  score2  score3  score4
0   100.0     NaN    52.0     NaN
3    95.0     NaN    98.0    65.0

In [34]:
df

   score1  score2  score3  score4
0   100.0    30.0      52     NaN
1    90.0     NaN      40     NaN
2     NaN    45.0      80     NaN
3    95.0    56.0      98    65.0

- 특정 열 안에서만 삭제

In [29]:
df.dropna(subset=['score2', 'score4'])

   score1  score2  score3  score4
3    95.0    56.0      98    65.0

- 결측치 채우기

In [31]:
#특정한 단일값으로 채우고 싶을 때
df.fillna(0)

   score1  score2  score3  score4
0   100.0    30.0      52     0.0
1    90.0     0.0      40     0.0
2     0.0    45.0      80     0.0
3    95.0    56.0      98    65.0

- 결측치 바로 이전의 값으로 채우기
    - 각 nan값들이 이전의 값들로 채워짐
    - 앞의 행이 nan값이면 채워지지  않고 그대로 nan값을 가짐

In [32]:
df.fillna(method='pad')

   score1  score2  score3  score4
0   100.0    30.0      52     NaN
1    90.0    30.0      40     NaN
2    90.0    45.0      80     NaN
3    95.0    56.0      98    65.0

- 결측치 바로 뒤의 값으로 채우기

In [33]:
df.fillna(method='bfill')

   score1  score2  score3  score4
0   100.0    30.0      52    65.0
1    90.0    45.0      40    65.0
2    95.0    45.0      80    65.0
3    95.0    56.0      98    65.0

- 결측치를 각 열의 평균값으로 채우기

In [35]:
df.fillna(df.mean())

   score1     score2  score3  score4
0   100.0  30.000000      52    65.0
1    90.0  43.666667      40    65.0
2    95.0  45.000000      80    65.0
3    95.0  56.000000      98    65.0

- 결측치를 각 열의 중간값, 최소값, 최대값으로 채우기

In [40]:
#중간값
df.fillna(df.median())

   score1  score2  score3  score4
0   100.0    30.0      52    65.0
1    90.0    45.0      40    65.0
2    95.0    45.0      80    65.0
3    95.0    56.0      98    65.0

In [38]:
#최소값
df.fillna(df.min())

   score1  score2  score3  score4
0   100.0    30.0      52    65.0
1    90.0    30.0      40    65.0
2    90.0    45.0      80    65.0
3    95.0    56.0      98    65.0

In [37]:
#최대값
df.fillna(df.max())

   score1  score2  score3  score4
0   100.0    30.0      52    65.0
1    90.0    56.0      40    65.0
2   100.0    45.0      80    65.0
3    95.0    56.0      98    65.0

- replace() 함수를 사용해서 결측치를 채우기
    - 지정한 값으로 결측치들이 모두 채워지게 됨(이 부분은 fillna랑 같음)
    - replace() 함수는 nan값 대신에 특정한 문자를 다른 문자로 바꾸고 싶을 때 유용하게 사용

In [41]:
df.replace(to_replace=np.nan, value=0)

   score1  score2  score3  score4
0   100.0    30.0      52     0.0
1    90.0     0.0      40     0.0
2     0.0    45.0      80     0.0
3    95.0    56.0      98    65.0

- interpolate() 함수로 결측치 채우기

In [42]:
# 'linear': null 값의 앞의 행과 뒤의 행의 중간값으로 결측치를 채워줌
df.interpolate(method='linear', limit_direction='forward')

   score1  score2  score3  score4
0   100.0    30.0      52     NaN
1    90.0    37.5      40     NaN
2    92.5    45.0      80     NaN
3    95.0    56.0      98    65.0

In [46]:
df.interpolate(method='pad', limit=2)

   score1  score2  score3  score4
0   100.0    30.0      52     NaN
1    90.0    30.0      40     NaN
2    90.0    45.0      80     NaN
3    95.0    56.0      98    65.0

- 범주형 데이터를 원핫인코딩으로 변경

In [49]:
df = pd.read_csv('mushrooms.csv')
df.head()

,class,cap-shape,cap-surface,cap-color,bruises,odor,gill-attachment,gill-spacing,gill-size,gill-color,...,stalk-surface-below-ring,stalk-color-above-ring,stalk-color-below-ring,veil-type,veil-color,ring-number,ring-type,spore-print-color,population,habitat
0,p,x,s,n,t,p,f,c,n,k,...,s,w,w,p,w,o,p,k,s,u
1,e,x,s,y,t,a,f,c,b,k,...,s,w,w,p,w,o,p,n,n,g
2,e,b,s,w,t,l,f,c,b,n,...,s,w,w,p,w,o,p,n,n,m
3,p,x,y,w,t,p,f,c,n,n,...,s,w,w,p,w,o,p,k,s,u
4,e,x,s,g,f,n,f,w,b,k,...,s,w,w,p,w,o,e,n,a,g